espressif/arduino-esp32/cores/esp32/esp32-hal-uart.c
  // Initialize LP_IO
  if (rtc_gpio_init(pin) != ESP_OK) {
    log_e("Failed to initialize LP_IO %d", pin);
    return false;
  }

  // Set LP_IO direction
  if (rtc_gpio_set_direction(pin, direction) != ESP_OK) {
    log_e("Failed to set LP_IO %d direction", pin);
    return false;
  }

  // Connect pins
  const uart_periph_sig_t *upin = &uart_periph_signal[uart_num].pins[idx];
#if !SOC_LP_GPIO_MATRIX_SUPPORTED  // ESP32-C6/C61/C5
  // When LP_IO Matrix is not support, LP_IO Mux must be connected to the pins
  if (rtc_gpio_iomux_func_sel(pin, upin->iomux_func) != ESP_OK) {
    log_e("Failed to set LP_IO pin %d into Mux function", pin);
    return false;
  }
#else   // So far, only ESP32-P4
  // If the configured pin is the default LP_IO Mux pin for LP UART, then set the LP_IO MUX function
  if (upin->default_gpio == pin) {
    if (rtc_gpio_iomux_func_sel(pin, upin->iomux_func) != ESP_OK) {
      log_e("Failed to set LP_IO pin %d into Mux function", pin);
      return false;
    }
  } else {
    // Otherwise, set the LP_IO Matrix and select FUNC1
    if (rtc_gpio_iomux_func_sel(pin, 1) != ESP_OK) {
      log_e("Failed to set LP_IO pin %d into Mux function GPIO", pin);
      return false;
    }
    // Connect the LP_IO to the LP UART peripheral signal
    esp_err_t ret;
    if (direction == RTC_GPIO_MODE_OUTPUT_ONLY) {
      ret = lp_gpio_connect_out_signal(pin, UART_PERIPH_SIGNAL(uart_num, idx), 0, 0);
    } else {
      ret = lp_gpio_connect_in_signal(pin, UART_PERIPH_SIGNAL(uart_num, idx), 0);
    }
    if (ret != ESP_OK) {
      log_e("Failed to connect LP_IO pin %d to UART%u signal", pin, uart_num);
      return false;
    }
  }
#endif  // SOC_LP_GPIO_MATRIX_SUPPORTED

  return true;
}

// When LP UART needs the RTC IO MUX to set the pin, it will always have fixed pins for RX, TX, CTS and RTS
static bool lpuartCheckPins(int8_t rxPin, int8_t txPin, int8_t ctsPin, int8_t rtsPin, uint8_t uart_nr) {
// check if LP UART is being used and if the pins are valid
#if !SOC_LP_GPIO_MATRIX_SUPPORTED  // ESP32-C6/C61/C5
  int16_t lp_uart_fixed_pin = uart_periph_signal[uart_nr].pins[SOC_UART_RX_PIN_IDX].default_gpio;
  bool allPinsAreGood = true;
  if (uart_nr >= SOC_UART_HP_NUM) {  // it is a LP UART NUM
    if (rxPin >= 0 && rxPin != lp_uart_fixed_pin) {
      log_e("UART%u LP UART requires RX pin to be set to %d", uart_nr, lp_uart_fixed_pin);
      allPinsAreGood = false;
    }
    lp_uart_fixed_pin = uart_periph_signal[uart_nr].pins[SOC_UART_TX_PIN_IDX].default_gpio;
    if (txPin >= 0 && txPin != lp_uart_fixed_pin) {
      log_e("UART%u LP UART requires TX pin to be set to %d", uart_nr, lp_uart_fixed_pin);
      allPinsAreGood = false;
    }
    lp_uart_fixed_pin = uart_periph_signal[uart_nr].pins[SOC_UART_CTS_PIN_IDX].default_gpio;
    if (ctsPin >= 0 && ctsPin != lp_uart_fixed_pin) {
      log_e("UART%u LP UART requires CTS pin to be set to %d", uart_nr, lp_uart_fixed_pin);
      allPinsAreGood = false;
    }
    lp_uart_fixed_pin = uart_periph_signal[uart_nr].pins[SOC_UART_RTS_PIN_IDX].default_gpio;
    if (rtsPin >= 0 && rtsPin != lp_uart_fixed_pin) {
      log_e("UART%u LP UART requires RTS pin to be set to %d", uart_nr, lp_uart_fixed_pin);
      allPinsAreGood = false;
    }
  }
  return allPinsAreGood;
#else   // ESP32-P4 can set any pin for LP UART
  return true;
#endif  // SOC_LP_GPIO_MATRIX_SUPPORTED
}
#endif  // SOC_UART_LP_NUM >= 1

#ifndef GPIO_FUNC_IN_LOW
#define GPIO_FUNC_IN_LOW GPIO_MATRIX_CONST_ZERO_INPUT
#endif

#ifndef GPIO_FUNC_IN_HIGH
#define GPIO_FUNC_IN_HIGH GPIO_MATRIX_CONST_ONE_INPUT
#endif

#define _UART_PERIMAN_TYPE_MIN ESP32_BUS_TYPE_UART_RX
#define _UART_PERIMAN_TYPE_MAX ESP32_BUS_TYPE_UART_RX_TX

static bool _uartRxPadInverted(const uart_t *u) {
  return (u->inv_mask & UART_SIGNAL_RXD_INV) != 0;
}

static bool _uartIsOneWireActive(const uart_t *uart) {
  return uart->_rxPin >= 0 && uart->_rxPin == uart->_txPin;
}

static bool _uartApplyRxPull(uart_t *uart, int8_t rxPin);
static bool _uartApplyOneWireOpenDrain(int8_t pin, bool enable);
static bool _uartDetachSharedPin(uint8_t uart_num, int8_t pin);
static bool _uartAttachSharedPin(uint8_t uart_num, int8_t pin);
static bool _uartDetachBus_RX_TX(void *busptr);

static bool _uartApplyOneWireOpenDrain(int8_t pin, bool enable) {
  if (pin < 0) {
    return true;
  }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
  esp_err_t err = enable ? gpio_od_enable((gpio_num_t)pin) : gpio_od_disable((gpio_num_t)pin);
  if (err != ESP_OK) {
    log_e("Failed to %s open-drain on UART one-wire pin %d: %s", enable ? "enable" : "disable", pin, esp_err_to_name(err));
    return false;
  }
#else
  // IDF < 5.4 has no gpio_od_*; match the gpio_ll_* fallback used elsewhere in this file.
  if (enable) {
    gpio_ll_od_enable(&GPIO, (uint32_t)pin);
  } else {
    gpio_ll_od_disable(&GPIO, (uint32_t)pin);
  }
#endif
  return true;
}

static bool _uartApplyRxPull(uart_t *uart, int8_t rxPin) {
  if (rxPin < 0) {
    return true;
  }

  if (_uartIsOneWireActive(uart)) {
#if (SOC_UART_LP_NUM >= 1) && (SOC_RTCIO_PIN_COUNT >= 1)
    if (uart->num >= SOC_UART_HP_NUM) {
      rtc_gpio_pullup_dis((gpio_num_t)rxPin);
      rtc_gpio_pulldown_dis((gpio_num_t)rxPin);
      return true;
    }
#endif
    gpio_pullup_dis((gpio_num_t)rxPin);
    gpio_pulldown_dis((gpio_num_t)rxPin);
    return true;
  }

  if (!uart->_rxPullEnabled) {
#if (SOC_UART_LP_NUM >= 1) && (SOC_RTCIO_PIN_COUNT >= 1)
    if (uart->num >= SOC_UART_HP_NUM) {
      rtc_gpio_pullup_dis((gpio_num_t)rxPin);
      rtc_gpio_pulldown_dis((gpio_num_t)rxPin);
      return true;
    }
#endif
    gpio_pullup_dis((gpio_num_t)rxPin);
    gpio_pulldown_dis((gpio_num_t)rxPin);
    return true;
  }

  bool inv = _uartRxPadInverted(uart);
#if (SOC_UART_LP_NUM >= 1) && (SOC_RTCIO_PIN_COUNT >= 1)
  if (uart->num >= SOC_UART_HP_NUM) {
    if (inv) {
      rtc_gpio_pullup_dis((gpio_num_t)rxPin);
      rtc_gpio_pulldown_en((gpio_num_t)rxPin);
    } else {
      rtc_gpio_pulldown_dis((gpio_num_t)rxPin);
      rtc_gpio_pullup_en((gpio_num_t)rxPin);
    }
    return true;
  }
#endif
  if (inv) {
    gpio_pullup_dis((gpio_num_t)rxPin);
    gpio_pulldown_en((gpio_num_t)rxPin);
  } else {
    gpio_pulldown_dis((gpio_num_t)rxPin);
    gpio_pullup_en((gpio_num_t)rxPin);
  }
  return true;
}

// Validate all pins together before attempting attachment
// Issues all error messages for any invalid pins, then returns true or false
static bool _uartValidatePins(uint8_t uart_num, int8_t rxPin, int8_t txPin, int8_t ctsPin, int8_t rtsPin) {
  if (uart_num >= SOC_UART_NUM) {
    log_e("UART number is invalid, please use number from 0 to %u", SOC_UART_NUM - 1);
    return false;
  }

#if SOC_UART_LP_NUM >= 1
  // check if LP UART is being used and if the pins are valid
  if (!lpuartCheckPins(rxPin, txPin, ctsPin, rtsPin, uart_num)) {
    return false;
  }
#endif

  bool allPinsAreGood = true;

