espressif/arduino-esp32/cores/esp32/esp32-hal-uart.c
  // Validate RX pin (input, any valid GPIO)
  if (rxPin >= 0) {
    if (!GPIO_IS_VALID_GPIO(rxPin)) {
      log_e("UART%u invalid RX pin %d", uart_num, rxPin);
      allPinsAreGood = false;
    }
  }

  // Validate TX pin (output capable)
  if (txPin >= 0) {
    if (!GPIO_IS_VALID_OUTPUT_GPIO(txPin)) {
      log_e("UART%u invalid TX pin %d", uart_num, txPin);
      allPinsAreGood = false;
    }
  }

  // Validate CTS pin (input, any valid GPIO)
  if (ctsPin >= 0) {
    if (!GPIO_IS_VALID_GPIO(ctsPin)) {
      log_e("UART%u invalid CTS pin %d", uart_num, ctsPin);
      allPinsAreGood = false;
    }
  }

  // Validate RTS pin (output capable)
  if (rtsPin >= 0) {
    if (!GPIO_IS_VALID_OUTPUT_GPIO(rtsPin)) {
      log_e("UART%u invalid RTS pin %d", uart_num, rtsPin);
      allPinsAreGood = false;
    }
  }

  uart_t *uart = &_uart_bus_array[uart_num];

  // One-wire is automatic when effective RX and TX resolve to the same GPIO.
  // -1 means "keep the current pin" (e.g. RX=2 TX=3 then setPins(-1, 2) => RX=TX=2).
  const int8_t effectiveRx = (rxPin >= 0) ? rxPin : uart->_rxPin;
  const int8_t effectiveTx = (txPin >= 0) ? txPin : uart->_txPin;
  const int8_t effectiveCts = (ctsPin >= 0) ? ctsPin : uart->_ctsPin;
  const int8_t effectiveRts = (rtsPin >= 0) ? rtsPin : uart->_rtsPin;
  if (effectiveRx >= 0 && effectiveTx >= 0 && effectiveRx == effectiveTx) {
    if (uart->_uart_mode != UART_MODE_UART) {
      log_e("UART%u one-wire mode is not compatible with the current UART mode", uart_num);
      allPinsAreGood = false;
#if (SOC_UART_LP_NUM >= 1) && !SOC_LP_GPIO_MATRIX_SUPPORTED
    } else if (uart_num >= SOC_UART_HP_NUM) {
      log_e("UART%u LP UART does not support one-wire mode on this SoC", uart_num);
      allPinsAreGood = false;
#endif
    }
    if (effectiveCts == effectiveRx) {
      log_e("UART%u one-wire RX/TX pin %d cannot also be used for CTS", uart_num, effectiveRx);
      allPinsAreGood = false;
    }
    if (effectiveRts == effectiveRx) {
      log_e("UART%u one-wire RX/TX pin %d cannot also be used for RTS", uart_num, effectiveRx);
      allPinsAreGood = false;
    }
  }

  return allPinsAreGood;
}

// Negative Pin Number will keep it unmodified, thus this function can detach individual pins
// This function will also unset the pins in the Peripheral Manager and set the pin to -1 after detaching
static bool _uartDetachPins(uint8_t uart_num, int8_t rxPin, int8_t txPin, int8_t ctsPin, int8_t rtsPin) {
  if (uart_num >= SOC_UART_NUM) {
    log_e("Serial number is invalid, please use number from 0 to %u", SOC_UART_NUM - 1);
    return false;
  }
  // get UART information
  uart_t *uart = &_uart_bus_array[uart_num];
  bool retCode = true;
  //log_v("detaching UART%u pins: prev,pin RX(%d,%d) TX(%d,%d) CTS(%d,%d) RTS(%d,%d)", uart_num,
  //        uart->_rxPin, rxPin, uart->_txPin, txPin, uart->_ctsPin, ctsPin, uart->_rtsPin, rtsPin); vTaskDelay(10);

  // detaches HP and LP pins and sets Peripheral Manager and UART information
  if (rxPin >= 0 && uart->_rxPin == rxPin && _uartIsOneWireActive(uart) && perimanGetPinBusType(rxPin) == ESP32_BUS_TYPE_UART_RX_TX) {
    esp_rom_gpio_pad_select_gpio(rxPin);
    if (_uartRxPadInverted(uart)) {
      esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_LOW, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
    } else {
      esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_HIGH, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
    }
    esp_rom_gpio_connect_out_signal(rxPin, SIG_GPIO_OUT_IDX, false, false);
    uart->_rxPin = -1;
    uart->_txPin = -1;
    if (!perimanClearPinBus(rxPin)) {
      retCode = false;
      log_e("UART%u failed to detach shared RX/TX pin %d", uart_num, rxPin);
    }
  } else if (rxPin >= 0 && uart->_rxPin == rxPin && perimanGetPinBusType(rxPin) == ESP32_BUS_TYPE_UART_RX) {
    //gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[rxPin], PIN_FUNC_GPIO);
    esp_rom_gpio_pad_select_gpio(rxPin);
    // avoids causing BREAK in the UART line
    if (_uartRxPadInverted(uart)) {
      esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_LOW, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
    } else {
      esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_HIGH, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
    }
    // Mirror _uartApplyRxPull(): LP UART RX pulls use RTC GPIO APIs; clear those on detach.
#if (SOC_UART_LP_NUM >= 1) && (SOC_RTCIO_PIN_COUNT >= 1)
    if (uart_num >= SOC_UART_HP_NUM) {
      rtc_gpio_pullup_dis((gpio_num_t)rxPin);
      rtc_gpio_pulldown_dis((gpio_num_t)rxPin);
    } else
#endif
    {
      gpio_pullup_dis((gpio_num_t)rxPin);
      gpio_pulldown_dis((gpio_num_t)rxPin);
    }
    uart->_rxPin = -1;  // -1 means unassigned/detached
    if (!perimanClearPinBus(rxPin)) {
      retCode = false;
      log_e("UART%u failed to detach RX pin %d", uart_num, rxPin);
    }
  }
  if (txPin >= 0 && uart->_txPin == txPin && !_uartIsOneWireActive(uart) && perimanGetPinBusType(txPin) == ESP32_BUS_TYPE_UART_TX) {
    //gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[txPin], PIN_FUNC_GPIO);
    esp_rom_gpio_pad_select_gpio(txPin);
    esp_rom_gpio_connect_out_signal(txPin, SIG_GPIO_OUT_IDX, false, false);
    uart->_txPin = -1;  // -1 means unassigned/detached
    if (!perimanClearPinBus(txPin)) {
      retCode = false;
      log_e("UART%u failed to detach TX pin %d", uart_num, txPin);
    }
  }
  if (ctsPin >= 0 && uart->_ctsPin == ctsPin && perimanGetPinBusType(ctsPin) == ESP32_BUS_TYPE_UART_CTS) {
    //gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[ctsPin], PIN_FUNC_GPIO);
    esp_rom_gpio_pad_select_gpio(ctsPin);
    esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_LOW, UART_PERIPH_SIGNAL(uart_num, SOC_UART_CTS_PIN_IDX), false);
    uart->_ctsPin = -1;  // -1 means unassigned/detached
    if (!perimanClearPinBus(ctsPin)) {
      retCode = false;
      log_e("UART%u failed to detach CTS pin %d", uart_num, ctsPin);
    }
  }
  if (rtsPin >= 0 && uart->_rtsPin == rtsPin && perimanGetPinBusType(rtsPin) == ESP32_BUS_TYPE_UART_RTS) {
    //gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[rtsPin], PIN_FUNC_GPIO);
    esp_rom_gpio_pad_select_gpio(rtsPin);
    esp_rom_gpio_connect_out_signal(rtsPin, SIG_GPIO_OUT_IDX, false, false);
    uart->_rtsPin = -1;  // -1 means unassigned/detached
    if (!perimanClearPinBus(rtsPin)) {
      retCode = false;
      log_e("UART%u failed to detach RTS pin %d", uart_num, rtsPin);
    }
  }
  return retCode;
}

// Peripheral Manager detach callback for each specific UART PIN
static bool _uartDetachBus_RX_TX(void *busptr) {
  if (busptr == NULL) {
    log_e("_uartDetachBus_RX_TX: busptr is NULL");
    return false;
  }
  uart_t *bus = (uart_t *)busptr;
  if (bus->_rxPin < 0 || bus->_rxPin != bus->_txPin) {
    log_d("_uartDetachBus_RX_TX: shared pin already detached for UART%u", bus->num);
    return true;
  }
  int8_t pin = bus->_rxPin;
  log_d("_uartDetachBus_RX_TX: detaching shared pin %d from UART%u, terminating driver", pin, bus->num);
  bool retCode = _uartApplyOneWireOpenDrain(pin, false);
  esp_rom_gpio_pad_select_gpio(pin);
  if (_uartRxPadInverted(bus)) {
    esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_LOW, UART_PERIPH_SIGNAL(bus->num, SOC_UART_RX_PIN_IDX), false);
  } else {
    esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_HIGH, UART_PERIPH_SIGNAL(bus->num, SOC_UART_RX_PIN_IDX), false);
  }
  esp_rom_gpio_connect_out_signal(pin, SIG_GPIO_OUT_IDX, false, false);
  bus->_rxPin = -1;
  bus->_txPin = -1;
  hardware_serial_end(bus->num);
  return retCode;
}

static bool _uartDetachSharedPin(uint8_t uart_num, int8_t pin) {
  if (pin < 0) {
    return true;
  }
  uart_t *uart = &_uart_bus_array[uart_num];
  if (!_uartIsOneWireActive(uart) || uart->_rxPin != pin) {
    return true;
  }
  bool retCode = _uartApplyOneWireOpenDrain(pin, false);
  esp_rom_gpio_pad_select_gpio(pin);
  if (_uartRxPadInverted(uart)) {
    esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_LOW, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
  } else {
    esp_rom_gpio_connect_in_signal(GPIO_FUNC_IN_HIGH, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
  }
  esp_rom_gpio_connect_out_signal(pin, SIG_GPIO_OUT_IDX, false, false);
  uart->_rxPin = -1;
  uart->_txPin = -1;
  return perimanClearPinBus(pin) && retCode;
}

static bool _uartDetachBus_RX(void *busptr) {
  // sanity check - it should never happen
  if (busptr == NULL) {
    log_e("_uartDetachBus_RX: busptr is NULL");
    return false;
  }
  uart_t *bus = (uart_t *)busptr;
  if (_uartIsOneWireActive(bus)) {
    return _uartDetachBus_RX_TX(busptr);
  }
  if (bus->_rxPin < 0) {
    log_d("_uartDetachBus_RX: RX pin already detached for UART%u", bus->num);
    return true;
  }
  if (bus->_txPin < 0) {  // both rx and tx pins are detached, terminate the uart driver
    log_d("_uartDetachBus_RX: both RX and TX pins detached for UART%u, terminating driver", bus->num);
    hardware_serial_end(bus->num);
    return true;
  }
  return _uartDetachPins(bus->num, bus->_rxPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
}

