espressif/arduino-esp32/cores/esp32/esp32-hal-uart.c
static bool _uartDetachBus_TX(void *busptr) {
  // sanity check - it should never happen
  if (busptr == NULL) {
    log_e("_uartDetachBus_TX: busptr is NULL");
    return false;
  }
  uart_t *bus = (uart_t *)busptr;
  if (_uartIsOneWireActive(bus)) {
    return _uartDetachBus_RX_TX(busptr);
  }
  if (bus->_txPin < 0) {
    log_d("_uartDetachBus_TX: TX pin already detached for UART%u", bus->num);
    return true;
  }
  if (bus->_rxPin < 0) {  // both rx and tx pins are detached, terminate the uart driver
    log_d("_uartDetachBus_TX: both RX and TX pins detached for UART%u, terminating driver", bus->num);
    hardware_serial_end(bus->num);
    return true;
  }
  return _uartDetachPins(bus->num, UART_PIN_NO_CHANGE, bus->_txPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
}

static bool _uartDetachBus_CTS(void *busptr) {
  // sanity check - it should never happen
  if (busptr == NULL) {
    log_e("_uartDetachBus_CTS: busptr is NULL");
    return false;
  }
  uart_t *bus = (uart_t *)busptr;
  if (bus->_ctsPin < 0) {
    log_d("_uartDetachBus_CTS: CTS pin already detached for UART%u", bus->num);
    return true;
  }
  return _uartDetachPins(bus->num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, bus->_ctsPin, UART_PIN_NO_CHANGE);
}

static bool _uartDetachBus_RTS(void *busptr) {
  // sanity check - it should never happen
  if (busptr == NULL) {
    log_e("_uartDetachBus_RTS: busptr is NULL");
    return false;
  }
  uart_t *bus = (uart_t *)busptr;
  if (bus->_rtsPin < 0) {
    log_d("_uartDetachBus_RTS: RTS pin already detached for UART%u", bus->num);
    return true;
  }
  return _uartDetachPins(bus->num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, bus->_rtsPin);
}

// Returns true when io_num is the native IOMUX pin for the given UART signal.
static bool _uartIsNativeIomuxPin(uart_port_t uart_num, int io_num, uint32_t idx) {
  if (uart_num >= SOC_UART_HP_NUM || io_num < 0) {
    return false;
  }
  const uart_periph_sig_t *upin = &uart_periph_signal[uart_num].pins[idx];
  return (upin->default_gpio != -1 && upin->default_gpio == io_num && upin->iomux_func != -1);
}

// This function will try setting HP UART IOMUX attaching for the requested pin.
// For LP UART attaching, it tries both, IOMUX and GPIO Matrix (ESP32-P4 only), whenever available.
// It must be called only after UART NUMBER and io_num have been validated
static bool _uartTrySetIomuxPin(uart_port_t uart_num, int io_num, uint32_t idx) {
  // Store a pointer to the default pin, to optimize access to its fields.
  const uart_periph_sig_t *upin = &uart_periph_signal[uart_num].pins[idx];

  if (uart_num < SOC_UART_HP_NUM) {
    // HP UART peripheral just tries to attach IOMUX and return success or failure
    // In theory, if default_gpio is -1, iomux_func should also be -1, but let's be safe and test both.
    if (upin->default_gpio == -1 || upin->default_gpio != io_num) {
      return false;
    }

    // Assign the correct function to the GPIO.
    if (upin->iomux_func == -1) {
      log_e("IO#%d has bad IOMUX internal information. Switching to GPIO Matrix UART function.", io_num);
      return false;
    }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
    if (upin->input) {
      return ESP_OK == gpio_iomux_input(io_num, upin->iomux_func, upin->signal);
    } else {
      return ESP_OK == gpio_iomux_output(io_num, upin->iomux_func);
    }
#else
    gpio_iomux_out(io_num, upin->iomux_func, false);
    // If the pin is input, we also have to redirect the signal, in order to bypass the GPIO matrix.
    if (upin->input) {
      gpio_iomux_in(io_num, upin->signal);
    }
#endif
  }
#if (SOC_UART_LP_NUM >= 1) && (SOC_RTCIO_PIN_COUNT >= 1)
  else {
    // if it is an LP UART peripheral, lp_uart_config_io() will try IOMUX (esp32-c5/c6/c61/p4) or GPIO Matrix (only for esp32-p4) pin attaching
    // Use lp_uart_config_io() for LP UART pin configuration with proper error checking
    rtc_gpio_mode_t direction = upin->input ? RTC_GPIO_MODE_INPUT_ONLY : RTC_GPIO_MODE_OUTPUT_ONLY;
    return lp_uart_config_io(uart_num, io_num, direction, idx);
  }
#endif
  return true;
}

static bool _uartInternalSetPin(uart_port_t uart_num, int tx_io_num, int rx_io_num, int rts_io_num, int cts_io_num) {
  bool retCode = true;
  bool tx_rx_same_io = (tx_io_num >= 0 && rx_io_num >= 0 && tx_io_num == rx_io_num);
  // In the following statements, if the io_num is negative, no need to configure anything.
  // _uartTrySetIomuxPin() will solve LP UART pin configuration using IOMUX and GPIO Matrix.
  // Only HP UART pins are configured in case _uartTrySetIomuxPin() returns false
  if (tx_io_num >= 0) {
#if CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND || CONFIG_PM_SLP_DISABLE_GPIO
    // In such case, IOs are going to switch to sleep configuration (isolate) when entering sleep for power saving reason
    // But TX IO in isolate state could write garbled data to the other end
    // Therefore, we should disable the switch of the TX pin to sleep configuration
    retCode &= ESP_OK == gpio_sleep_sel_dis(tx_io_num);
#endif
    if (tx_rx_same_io || !_uartTrySetIomuxPin(uart_num, tx_io_num, SOC_UART_TX_PIN_IDX)) {
      if (uart_num < SOC_UART_HP_NUM) {
        retCode &= ESP_OK == gpio_func_sel(tx_io_num, PIN_FUNC_GPIO);
        esp_rom_gpio_connect_out_signal(tx_io_num, UART_PERIPH_SIGNAL(uart_num, SOC_UART_TX_PIN_IDX), 0, 0);
      }
#if (SOC_UART_LP_NUM >= 1) && SOC_LP_GPIO_MATRIX_SUPPORTED
      else if (tx_rx_same_io) {
        retCode &= ESP_OK == rtc_gpio_init((gpio_num_t)tx_io_num);
        lp_gpio_connect_out_signal(tx_io_num, UART_PERIPH_SIGNAL(uart_num, SOC_UART_TX_PIN_IDX), 0, 0);
      }
#endif
      else if (!tx_rx_same_io) {
        // LP UART couldn't attach pin, therefore it has failed
        retCode = false;
      }
    }
  }

  if (rx_io_num >= 0) {
#if CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND || CONFIG_PM_SLP_DISABLE_GPIO
    // In such case, IOs are going to switch to sleep configuration (isolate) when entering sleep for power saving reason
    // But RX IO in isolate state could receive garbled data into FIFO, which is not desired
    // Therefore, we should disable the switch of the RX pin to sleep configuration
    retCode &= ESP_OK == gpio_sleep_sel_dis(rx_io_num);
#endif
    if (tx_rx_same_io || !_uartTrySetIomuxPin(uart_num, rx_io_num, SOC_UART_RX_PIN_IDX)) {
      if (uart_num < SOC_UART_HP_NUM) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
        retCode &= ESP_OK == gpio_input_enable(rx_io_num);
#else
        retCode &= ESP_OK == gpio_func_sel(rx_io_num, PIN_FUNC_GPIO);
        gpio_ll_input_enable(&GPIO, rx_io_num);
#endif
        esp_rom_gpio_connect_in_signal(rx_io_num, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), 0);
      }
#if (SOC_UART_LP_NUM >= 1) && SOC_LP_GPIO_MATRIX_SUPPORTED
      else if (tx_rx_same_io) {
        rtc_gpio_mode_t mode = RTC_GPIO_MODE_INPUT_OUTPUT;
        retCode &= ESP_OK == rtc_gpio_set_direction((gpio_num_t)rx_io_num, mode);
        lp_gpio_connect_in_signal(rx_io_num, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), 0);
      }
#endif
      else if (!tx_rx_same_io) {
        // LP UART couldn't attach pin, therefore it has failed
        retCode = false;
      }
    }
  }

  if (rts_io_num >= 0 && !_uartTrySetIomuxPin(uart_num, rts_io_num, SOC_UART_RTS_PIN_IDX)) {
    if (uart_num < SOC_UART_HP_NUM) {
      retCode &= ESP_OK == gpio_func_sel(rts_io_num, PIN_FUNC_GPIO);
      esp_rom_gpio_connect_out_signal(rts_io_num, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RTS_PIN_IDX), 0, 0);
    } else {
      // LP UART couldn't attach pin, therefore it has failed
      retCode = false;
    }
  }

  if (cts_io_num >= 0 && !_uartTrySetIomuxPin(uart_num, cts_io_num, SOC_UART_CTS_PIN_IDX)) {
    if (uart_num < SOC_UART_HP_NUM) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
      retCode &= ESP_OK == gpio_pullup_en(cts_io_num);
      retCode &= ESP_OK == gpio_input_enable(cts_io_num);
#else
      retCode &= ESP_OK == gpio_func_sel(cts_io_num, PIN_FUNC_GPIO);
      retCode &= ESP_OK == gpio_set_pull_mode(cts_io_num, GPIO_PULLUP_ONLY);
      retCode &= ESP_OK == gpio_set_direction(cts_io_num, GPIO_MODE_INPUT);
#endif
      esp_rom_gpio_connect_in_signal(cts_io_num, UART_PERIPH_SIGNAL(uart_num, SOC_UART_CTS_PIN_IDX), 0);
    } else {
      // LP UART couldn't attach pin, therefore it has failed
      retCode = false;
    }
  }
  return retCode;
}

