espressif/arduino-esp32/cores/esp32/esp32-hal-uart.c
static bool _uartAttachSharedPin(uint8_t uart_num, int8_t pin) {
  uart_t *uart = &_uart_bus_array[uart_num];
  bool attachSuccess = true;

  if (perimanGetPinBusType(pin) != ESP32_BUS_TYPE_INIT) {
    if (!perimanClearPinBus(pin)) {
      attachSuccess = false;
    }
  }
  if (attachSuccess && _uartInternalSetPin(uart->num, pin, pin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) && _uartApplyOneWireOpenDrain(pin, true)) {
    if (perimanSetPinBus(pin, ESP32_BUS_TYPE_UART_RX_TX, (void *)uart, uart_num, -1)) {
      if (perimanGetBusDeinit(ESP32_BUS_TYPE_UART_RX_TX) == NULL) {
        perimanSetBusDeinit(ESP32_BUS_TYPE_UART_RX_TX, _uartDetachBus_RX_TX);
      }
      uart->_rxPin = pin;
      uart->_txPin = pin;
      _uartApplyRxPull(uart, pin);
    } else {
      log_e("UART%u failed to register shared RX/TX pin %d", uart_num, pin);
      _uartApplyOneWireOpenDrain(pin, false);
      attachSuccess = false;
    }
  } else {
    attachSuccess = false;
  }
  if (!attachSuccess) {
    log_e("UART%u failed to attach shared RX/TX pin %d", uart_num, pin);
  }
  return attachSuccess;
}

// Attach function for UART
// connects the IO Pad, set Paripheral Manager and internal UART structure data
static bool _uartAttachPins(uint8_t uart_num, int8_t rxPin, int8_t txPin, int8_t ctsPin, int8_t rtsPin) {
  // get UART information
  uart_t *uart = &_uart_bus_array[uart_num];
  //log_v("attaching UART%u pins: prev,new RX(%d,%d) TX(%d,%d) CTS(%d,%d) RTS(%d,%d)", uart_num,
  //        uart->_rxPin, rxPin, uart->_txPin, txPin, uart->_ctsPin, ctsPin, uart->_rtsPin, rtsPin); vTaskDelay(10);

  bool retCode = true;
  bool attachSuccess;
  if (rxPin >= 0) {
    attachSuccess = true;
    // forces a clean detaching from a previous peripheral
    if (perimanGetPinBusType(rxPin) != ESP32_BUS_TYPE_INIT) {
      if (!perimanClearPinBus(rxPin)) {
        attachSuccess = false;
      }
    }
    if (attachSuccess && _uartInternalSetPin(uart->num, UART_PIN_NO_CHANGE, rxPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE)) {
      // connect RX Pad
      if (perimanSetPinBus(rxPin, ESP32_BUS_TYPE_UART_RX, (void *)uart, uart_num, -1)) {
        // set Peripheral Manager deInit Callback for this UART pin
        if (perimanGetBusDeinit(ESP32_BUS_TYPE_UART_RX) == NULL) {
          perimanSetBusDeinit(ESP32_BUS_TYPE_UART_RX, _uartDetachBus_RX);
        }
        uart->_rxPin = rxPin;
        _uartApplyRxPull(uart, rxPin);
      } else {
        log_e("UART%u failed to clear previous bus assignment on RX pin %d", uart_num, rxPin);
        attachSuccess = false;
      }
    } else {
      attachSuccess = false;
    }
    if (!attachSuccess) {
      log_e("UART%u failed to attach RX pin %d", uart_num, rxPin);
      retCode = false;
    }
  }
  if (txPin >= 0) {
    attachSuccess = true;
    // forces a clean detaching from a previous peripheral
    if (perimanGetPinBusType(txPin) != ESP32_BUS_TYPE_INIT) {
      if (!perimanClearPinBus(txPin)) {
        attachSuccess = false;
      }
    }
    if (attachSuccess && _uartInternalSetPin(uart->num, txPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE)) {
      // connect TX Pad
      if (perimanSetPinBus(txPin, ESP32_BUS_TYPE_UART_TX, (void *)uart, uart_num, -1)) {
        // set Peripheral Manager deInit Callback for this UART pin
        if (perimanGetBusDeinit(ESP32_BUS_TYPE_UART_TX) == NULL) {
          perimanSetBusDeinit(ESP32_BUS_TYPE_UART_TX, _uartDetachBus_TX);
        }
        uart->_txPin = txPin;
      } else {
        attachSuccess = false;
      }
    } else {
      attachSuccess = false;
    }
    if (!attachSuccess) {
      log_e("UART%u failed to attach TX pin %d", uart_num, txPin);
      retCode = false;
    }
  }
  if (ctsPin >= 0) {
    attachSuccess = true;
    // forces a clean detaching from a previous peripheral
    if (perimanGetPinBusType(ctsPin) != ESP32_BUS_TYPE_INIT) {
      if (!perimanClearPinBus(ctsPin)) {
        attachSuccess = false;
      }
    }
    if (attachSuccess && _uartInternalSetPin(uart->num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, ctsPin)) {
      // connect CTS Pad
      if (perimanSetPinBus(ctsPin, ESP32_BUS_TYPE_UART_CTS, (void *)uart, uart_num, -1)) {
        // set Peripheral Manager deInit Callback for this UART pin
        if (perimanGetBusDeinit(ESP32_BUS_TYPE_UART_CTS) == NULL) {
          perimanSetBusDeinit(ESP32_BUS_TYPE_UART_CTS, _uartDetachBus_CTS);
        }
        uart->_ctsPin = ctsPin;
      } else {
        attachSuccess = false;
      }
    } else {
      attachSuccess = false;
    }
    if (!attachSuccess) {
      log_e("UART%u failed to attach CTS pin %d", uart_num, ctsPin);
      retCode = false;
    }
  }
  if (rtsPin >= 0) {
    attachSuccess = true;
    // forces a clean detaching from a previous peripheral
    if (perimanGetPinBusType(rtsPin) != ESP32_BUS_TYPE_INIT) {
      if (!perimanClearPinBus(rtsPin)) {
        attachSuccess = false;
      }
    }
    if (attachSuccess && _uartInternalSetPin(uart->num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, rtsPin, UART_PIN_NO_CHANGE)) {
      // connect RTS Pad
      if (perimanSetPinBus(rtsPin, ESP32_BUS_TYPE_UART_RTS, (void *)uart, uart_num, -1)) {
        // set Peripheral Manager deInit Callback for this UART pin
        if (perimanGetBusDeinit(ESP32_BUS_TYPE_UART_RTS) == NULL) {
          perimanSetBusDeinit(ESP32_BUS_TYPE_UART_RTS, _uartDetachBus_RTS);
        }
        uart->_rtsPin = rtsPin;
      } else {
        attachSuccess = false;
      }
    } else {
      attachSuccess = false;
    }
    if (!attachSuccess) {
      log_e("UART%u failed to attach RTS pin %d", uart_num, rtsPin);
      retCode = false;
    }
  }
  return retCode;
}

// just helper functions
int8_t uart_get_RxPin(uint8_t uart_num) {
  return _uart_bus_array[uart_num]._rxPin;
}

int8_t uart_get_TxPin(uint8_t uart_num) {
  return _uart_bus_array[uart_num]._txPin;
}

int8_t uart_get_CtsPin(uint8_t uart_num) {
  return _uart_bus_array[uart_num]._ctsPin;
}

int8_t uart_get_RtsPin(uint8_t uart_num) {
  return _uart_bus_array[uart_num]._rtsPin;
}

// Routines that take care of UART events will be in the HardwareSerial Class code
void uartGetEventQueue(uart_t *uart, QueueHandle_t *q) {
  // passing back NULL for the Queue pointer when UART is not initialized yet
  *q = NULL;
  if (uart == NULL) {
    return;
  }
  *q = uart->uart_event_queue;
  return;
}

bool uartIsDriverInstalled(uart_t *uart) {
  if (uart == NULL) {
    return false;
  }

  if (uart_is_driver_installed(uart->num)) {
    return true;
  }
  return false;
}

// Negative Pin Number will keep it unmodified, thus this function can set individual pins
// When pins are changed, it will detach the previous one

