espressif/arduino-esp32/cores/esp32/esp32-hal-uart.c
// Helper function to detect if a pin needs to be attached and log the detection
// Eliminates duplication in detection phase for RX/TX/CTS/RTS
// Parameters:
//   pin          - The GPIO pin number to check (-1 means no change)
//   funcName     - String name of the function: "RX", "TX", "CTS", or "RTS"
//   expectedType - The ESP32_BUS_TYPE_UART_* constant for this function type
//   target_uart  - The target UART number where we want to assign this pin
//   needsAttach  - Output: true if pin needs to be attached to target UART
//   prevUARTOut  - Output: UART number that currently owns this pin (-1 if none or not UART)
static void _uartDetectPin(int8_t pin, const char *funcName, peripheral_bus_type_t expectedType, uint8_t target_uart, bool *needsAttach, int8_t *prevUARTOut) {
  *needsAttach = false;
  if (prevUARTOut != NULL) {
    *prevUARTOut = -1;
  }

  if (pin < 0) {
    return;  // Pin not being changed
  }

  peripheral_bus_type_t t = perimanGetPinBusType(pin);
  bool isUART = (t >= _UART_PERIMAN_TYPE_MIN && t <= _UART_PERIMAN_TYPE_MAX);
  int8_t prevU = isUART ? perimanGetPinBusNum(pin) : -1;

  *needsAttach = (t != expectedType || target_uart != prevU);
  if (prevUARTOut != NULL) {
    *prevUARTOut = prevU;  // Set to actual UART if owned, -1 otherwise
  }

  if (isUART) {
    log_v("%s: pin %d -> UART%d: currently [UART%d], attach=%s", funcName, pin, target_uart, prevU, *needsAttach ? "YES" : "NO");
  } else {
    log_v("%s: pin %d -> UART%d: currently [GPIO], attach=%s", funcName, pin, target_uart, *needsAttach ? "YES" : "NO");
  }
}

// Detaches 'pin' from its current UART assignment (if any) before reusing it for a new function.
// Only acts when 'needsAttach' is true (pin is being reassigned).
// If the pin was taken from a *different* UART than 'target_uart_num', stores that UART in
// '*prevOtherUARTOut' (for later termination check); sets it to -1 otherwise.
// Returns false if a detach operation failed.
static bool _uartDetachConflictingPin(int8_t pin, uint8_t target_uart_num, const char *target_func_name, bool needsAttach, int8_t *prevOtherUARTOut) {
  if (prevOtherUARTOut != NULL) {
    *prevOtherUARTOut = -1;
  }
  if (pin < 0 || !needsAttach) {
    return true;
  }

  peripheral_bus_type_t currentType = perimanGetPinBusType(pin);
  bool isPeriTypeUART = (currentType >= _UART_PERIMAN_TYPE_MIN && currentType <= _UART_PERIMAN_TYPE_MAX);
  if (!isPeriTypeUART) {
    return true;  // Pin not assigned to any UART; nothing to detach
  }

  int8_t prevUART = perimanGetPinBusNum(pin);

  // Build _uartDetachPins arguments from the pin's current function
  int8_t d_rx = UART_PIN_NO_CHANGE, d_tx = UART_PIN_NO_CHANGE;
  int8_t d_cts = UART_PIN_NO_CHANGE, d_rts = UART_PIN_NO_CHANGE;
  const char *currentFuncName;

  if (currentType == ESP32_BUS_TYPE_UART_RX) {
    d_rx = pin;
    currentFuncName = "RX";
  } else if (currentType == ESP32_BUS_TYPE_UART_TX) {
    d_tx = pin;
    currentFuncName = "TX";
  } else if (currentType == ESP32_BUS_TYPE_UART_RX_TX) {
    d_rx = pin;
    currentFuncName = "RX_TX";
  } else if (currentType == ESP32_BUS_TYPE_UART_CTS) {
    d_cts = pin;
    currentFuncName = "CTS";
  } else {  // ESP32_BUS_TYPE_UART_RTS
    d_rts = pin;
    currentFuncName = "RTS";
  }

  if (prevUART != target_uart_num) {
    log_d("Detaching pin %d (%s function) from UART%d", pin, currentFuncName, prevUART);
    if (prevOtherUARTOut != NULL) {
      *prevOtherUARTOut = prevUART;
    }
  } else {
    log_d("Detaching pin %d (%s function) from UART%d before using as %s", pin, currentFuncName, prevUART, target_func_name);
  }

  (void)currentFuncName;  // Suppress unused variable warning when log_d is compiled out
  return _uartDetachPins(prevUART, d_rx, d_tx, d_cts, d_rts);
}

bool uartSetPins(uint8_t uart_num, int8_t rxPin, int8_t txPin, int8_t ctsPin, int8_t rtsPin) {
  // check uart_num and pins
  if (!_uartValidatePins(uart_num, rxPin, txPin, ctsPin, rtsPin)) {
    return false;  // failed to set pins
  }

  // get UART information
  uart_t *uart = &_uart_bus_array[uart_num];

  //log_v("setting UART%u pins: prev->new RX(%d->%d) TX(%d->%d) CTS(%d->%d) RTS(%d->%d)", uart_num,
  //        uart->_rxPin, rxPin, uart->_txPin, txPin, uart->_ctsPin, ctsPin, uart->_rtsPin, rtsPin); vTaskDelay(10);

  bool retCode = true;
  UART_MUTEX_LOCK();

  // Resolve -1 (keep current). Same-pin effective RX/TX becomes an explicit (p, p) one-wire request.
  int8_t setRx = (rxPin >= 0) ? rxPin : uart->_rxPin;
  int8_t setTx = (txPin >= 0) ? txPin : uart->_txPin;
  bool oneWireRequest = (setRx >= 0 && setTx >= 0 && setRx == setTx);
  if (oneWireRequest) {
    rxPin = setRx;
    txPin = setTx;
  }

  // If driver is not yet installed, just store the pin configuration
  // The pins will be properly attached when the driver is installed in uartBegin()
  if (!uartIsDriverInstalled(uart)) {
    log_v("UART%u: Driver not yet installed, storing pins for later attachment (RX:%d, TX:%d)", uart_num, rxPin, txPin);
    if (rxPin >= 0) {
      uart->_rxPin = rxPin;
    }
    if (txPin >= 0) {
      uart->_txPin = txPin;
    }
    if (ctsPin >= 0) {
      uart->_ctsPin = ctsPin;
    }
    if (rtsPin >= 0) {
      uart->_rtsPin = rtsPin;
    }
    UART_MUTEX_UNLOCK();
    return true;
  }

  // mute bus detaching callbacks to avoid terminating the UART driver when both RX and TX pins are detached
  peripheral_bus_deinit_cb_t rxDeinit = perimanGetBusDeinit(ESP32_BUS_TYPE_UART_RX);
  peripheral_bus_deinit_cb_t txDeinit = perimanGetBusDeinit(ESP32_BUS_TYPE_UART_TX);
  peripheral_bus_deinit_cb_t rxTxDeinit = perimanGetBusDeinit(ESP32_BUS_TYPE_UART_RX_TX);
  peripheral_bus_deinit_cb_t ctsDeinit = perimanGetBusDeinit(ESP32_BUS_TYPE_UART_CTS);
  peripheral_bus_deinit_cb_t rtsDeinit = perimanGetBusDeinit(ESP32_BUS_TYPE_UART_RTS);
  perimanClearBusDeinit(ESP32_BUS_TYPE_UART_RX);
  perimanClearBusDeinit(ESP32_BUS_TYPE_UART_TX);
  perimanClearBusDeinit(ESP32_BUS_TYPE_UART_RX_TX);
  perimanClearBusDeinit(ESP32_BUS_TYPE_UART_CTS);
  perimanClearBusDeinit(ESP32_BUS_TYPE_UART_RTS);

  // Track original pins to detect if current UART lost RX/TX capability
  int8_t originalRxPin = uart->_rxPin;
  int8_t originalTxPin = uart->_txPin;

  // Determine whether each pin needs to be (re)attached and log verbose info
  bool rxAttach = false, txAttach = false, ctsAttach = false, rtsAttach = false;

  _uartDetectPin(rxPin, "RX", ESP32_BUS_TYPE_UART_RX, uart_num, &rxAttach, NULL);
  _uartDetectPin(txPin, "TX", ESP32_BUS_TYPE_UART_TX, uart_num, &txAttach, NULL);
  _uartDetectPin(ctsPin, "CTS", ESP32_BUS_TYPE_UART_CTS, uart_num, &ctsAttach, NULL);
  _uartDetectPin(rtsPin, "RTS", ESP32_BUS_TYPE_UART_RTS, uart_num, &rtsAttach, NULL);

  // Track which other UARTs had their pins taken (for termination check after attach)
  int8_t rxPinPrevUART = -1, txPinPrevUART = -1, ctsPinPrevUART = -1, rtsPinPrevUART = -1;

  // oneWireRequest was resolved above from effective RX/TX (including -1 keep-current).
  bool sharedAttach = false;
  if (oneWireRequest) {
    peripheral_bus_type_t pinType = perimanGetPinBusType(rxPin);
    sharedAttach = (pinType != ESP32_BUS_TYPE_UART_RX_TX || perimanGetPinBusNum(rxPin) != (int8_t)uart_num);
  }

  // First step: detach old one-wire pin when switching away from shared RX/TX
  if (_uartIsOneWireActive(uart)) {
    int8_t sharedPin = uart->_rxPin;
    bool keepShared = setRx == sharedPin && setTx == sharedPin;
    if (!keepShared) {
      log_d("Detaching old shared RX/TX pin %d from UART%d", sharedPin, uart_num);
      retCode &= _uartDetachSharedPin(uart_num, sharedPin);
      // Detaching shared ownership clears both stored pins. Reattach both effective
      // targets, including a side supplied as -1 ("keep current").
      rxPin = setRx;
      txPin = setTx;
      rxAttach = rxPin >= 0;
      txAttach = txPin >= 0;
    }
  }

  // First step: for each pin, detach any conflict (pin already assigned elsewhere),
  // then detach the old pin of this UART that is being replaced.
  if (!_uartIsOneWireActive(uart) && rxPin >= 0) {
    retCode &= _uartDetachConflictingPin(rxPin, uart_num, "RX", rxAttach, &rxPinPrevUART);
    if (rxPin != uart->_rxPin && uart->_rxPin >= 0) {
      log_d("Detaching old RX pin %d from UART%d", uart->_rxPin, uart_num);
      retCode &= _uartDetachPins(uart_num, uart->_rxPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    }
  }
  if (!_uartIsOneWireActive(uart) && txPin >= 0) {
    retCode &= _uartDetachConflictingPin(txPin, uart_num, "TX", txAttach, &txPinPrevUART);
    if (txPin != uart->_txPin && uart->_txPin >= 0) {
      log_d("Detaching old TX pin %d from UART%d", uart->_txPin, uart_num);
      retCode &= _uartDetachPins(uart_num, UART_PIN_NO_CHANGE, uart->_txPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    }
  }
  if (ctsPin >= 0) {
    retCode &= _uartDetachConflictingPin(ctsPin, uart_num, "CTS", ctsAttach, &ctsPinPrevUART);
    if (ctsPin != uart->_ctsPin && uart->_ctsPin >= 0) {
      log_d("Detaching old CTS pin %d from UART%d", uart->_ctsPin, uart_num);
      retCode &= _uartDetachPins(uart_num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, uart->_ctsPin, UART_PIN_NO_CHANGE);
    }
  }
  if (rtsPin >= 0) {
    retCode &= _uartDetachConflictingPin(rtsPin, uart_num, "RTS", rtsAttach, &rtsPinPrevUART);
    if (rtsPin != uart->_rtsPin && uart->_rtsPin >= 0) {
      log_d("Detaching old RTS pin %d from UART%d", uart->_rtsPin, uart_num);
      retCode &= _uartDetachPins(uart_num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, uart->_rtsPin);
    }
  }

  // Second step: attach all UART new pins
  if (oneWireRequest) {
    if (sharedAttach) {
      retCode &= _uartDetachConflictingPin(rxPin, uart_num, "RX_TX", true, &rxPinPrevUART);
      log_d("Attaching pin %d to UART%d as shared RX/TX (one-wire)", rxPin, uart_num);
      retCode &= _uartAttachSharedPin(uart_num, rxPin);
    }
  } else {
    if (rxAttach) {
      log_d("Attaching pin %d to UART%d as RX", rxPin, uart_num);
      retCode &= _uartAttachPins(uart_num, rxPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    }
    if (txAttach) {
      log_d("Attaching pin %d to UART%d as TX", txPin, uart_num);
      retCode &= _uartAttachPins(uart_num, UART_PIN_NO_CHANGE, txPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    }
  }
  if (ctsAttach) {
    log_d("Attaching pin %d to UART%d as CTS", ctsPin, uart_num);
    retCode &= _uartAttachPins(uart_num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, ctsPin, UART_PIN_NO_CHANGE);
  }
  if (rtsAttach) {
    log_d("Attaching pin %d to UART%d as RTS", rtsPin, uart_num);
    retCode &= _uartAttachPins(uart_num, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, rtsPin);
  }

