espressif/arduino-esp32/cores/esp32/esp32-hal-uart.c
  // Keep-current setPins calls do not reattach the shared pin, so reassert the
  // electrical one-wire policy in case another low-level operation changed it.
  if (oneWireRequest && _uartIsOneWireActive(uart)) {
    retCode &= _uartApplyOneWireOpenDrain(uart->_rxPin, true);
  }

  // Collect unique UARTs that lost both RX and TX (need termination after mutex release)
  int8_t uartsToTerminate[SOC_UART_NUM];
  for (int i = 0; i < SOC_UART_NUM; i++) {
    uartsToTerminate[i] = -1;
  }
  int terminateCount = 0;

  int8_t prevUARTCandidates[4] = {rxPinPrevUART, txPinPrevUART, ctsPinPrevUART, rtsPinPrevUART};
  for (int i = 0; i < 4; i++) {
    int8_t prevU = prevUARTCandidates[i];
    if (prevU < 0) {
      continue;
    }
    bool alreadyTracked = false;
    for (int j = 0; j < terminateCount; j++) {
      if (uartsToTerminate[j] == prevU) {
        alreadyTracked = true;
        break;
      }
    }
    if (!alreadyTracked) {
      uart_t *prevUart = &_uart_bus_array[prevU];
      if (prevUart->_rxPin < 0 && prevUart->_txPin < 0) {
        log_d("UART%d marked for termination (lost both RX and TX pins)", prevU);
        uartsToTerminate[terminateCount++] = prevU;
      }
    }
  }

  // Check if current UART lost both RX and TX pins (was functional, now has none)
  bool terminateCurrentUart = false;
  if ((originalRxPin >= 0 || originalTxPin >= 0) && rxPin < 0 && txPin < 0 && uart->_rxPin < 0 && uart->_txPin < 0) {
    log_d("UART%d marked for termination (RX/TX pins removed)", uart_num);
    terminateCurrentUart = true;
  }

  // Restore peripheral manager callbacks after all pin operations
  if (rxDeinit != NULL) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_UART_RX, rxDeinit);
  }
  if (txDeinit != NULL) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_UART_TX, txDeinit);
  }
  if (rxTxDeinit != NULL) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_UART_RX_TX, rxTxDeinit);
  }
  if (ctsDeinit != NULL) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_UART_CTS, ctsDeinit);
  }
  if (rtsDeinit != NULL) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_UART_RTS, rtsDeinit);
  }

  UART_MUTEX_UNLOCK();

  if (!retCode) {
    log_e("UART%u set pins failed.", uart_num);
  }

  // Execute terminations AFTER releasing the mutex to avoid deadlock
  for (int i = 0; i < terminateCount; i++) {
    if (uartsToTerminate[i] >= 0) {
      log_d("Terminating UART%d driver since both RX and TX pins were detached", uartsToTerminate[i]);
      hardware_serial_end(uartsToTerminate[i]);
    }
  }

  if (terminateCurrentUart) {
    log_d("Terminating UART%d driver since all RX/TX pins were removed and no new pins were set", uart_num);
    hardware_serial_end(uart_num);
  }

  return retCode;
}

//
bool uartSetHwFlowCtrlMode(uart_t *uart, uart_hw_flowcontrol_t mode, uint8_t threshold) {
  if (uart == NULL) {
    return false;
  }
  // IDF will issue corresponding error message when mode or threshold are wrong and prevent crashing
  // IDF will check (mode > HW_FLOWCTRL_CTS_RTS || threshold >= SOC_UART_FIFO_LEN)
  UART_MUTEX_LOCK();
  bool retCode = (ESP_OK == uart_set_hw_flow_ctrl(uart->num, mode, threshold));
  UART_MUTEX_UNLOCK();
  return retCode;
}

// This helper function will return true if a new IDF UART driver needs to be restarted and false if the current one can continue its execution
bool _testUartBegin(
  uint8_t uart_nr, uint32_t baudrate, uint32_t config, int8_t rxPin, int8_t txPin, uint32_t rx_buffer_size, uint32_t tx_buffer_size, bool inverted,
  uint8_t rxfifo_full_thrhd
) {
  if (uart_nr >= SOC_UART_NUM) {
    return false;  // no new driver has to be installed
  }
  uart_t *uart = &_uart_bus_array[uart_nr];
  // verify if is necessary to restart the UART driver
  if (uart_is_driver_installed(uart_nr)) {
    // some parameters can't be changed unless we end the UART driver
    if (uart->_rx_buffer_size != rx_buffer_size || uart->_tx_buffer_size != tx_buffer_size || uart->_inverted != inverted
        || uart->_rxfifo_full_thrhd != rxfifo_full_thrhd) {
      return true;  // the current IDF UART driver must be terminated and a new driver shall be installed
    } else {
      return false;  // The current IDF UART driver can continue its execution
    }
  } else {
    return true;  // no IDF UART driver is running and a new driver shall be installed
  }
}

uart_t *uartBegin(
  uint8_t uart_nr, uint32_t baudrate, uint32_t config, int8_t rxPin, int8_t txPin, uint32_t rx_buffer_size, uint32_t tx_buffer_size, bool inverted,
  uint8_t rxfifo_full_thrhd
) {
  log_v("UART%u baud(%" PRIu32 ") Mode(0x%" PRIx32 ") rxPin(%d) txPin(%d)", uart_nr, baudrate, config, rxPin, txPin);

  // check uart_nr, rx and tx pins, if necessary log error message and return a valid value
  if (!_uartValidatePins(uart_nr, rxPin, txPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE)) {
    if (uart_nr < SOC_UART_NUM && uart_is_driver_installed(uart_nr)) {
      return &_uart_bus_array[uart_nr];  // keep the same installed driver
    } else {
      return NULL;  // no new driver was installed
    }
  }

  // get the uart internal information
  uart_t *uart = &_uart_bus_array[uart_nr];

#if !CONFIG_DISABLE_HAL_LOCKS
  if (uart->lock == NULL) {
    uart->lock = xSemaphoreCreateMutex();
    if (uart->lock == NULL) {
      log_e("HAL LOCK error.");
      return NULL;  // no new driver was installed
    }
  }
#endif

  if (uart_is_driver_installed(uart_nr)) {
    log_v("UART%u Driver already installed.", uart_nr);
    // some parameters can't be changed unless we end the UART driver
    if (uart->_rx_buffer_size != rx_buffer_size || uart->_tx_buffer_size != tx_buffer_size || uart->_inverted != inverted
        || uart->_rxfifo_full_thrhd != rxfifo_full_thrhd) {
      log_v("UART%u changing buffer sizes or inverted signal or rxfifo_full_thrhd. IDF driver will be restarted", uart_nr);
      log_v("RX buffer size: %u -> %" PRIu32, uart->_rx_buffer_size, rx_buffer_size);
      log_v("TX buffer size: %u -> %" PRIu32, uart->_tx_buffer_size, tx_buffer_size);
      log_v("Inverted signal: %s -> %s", uart->_inverted ? "true" : "false", inverted ? "true" : "false");
      log_v("RX FIFO full threshold: %u -> %u", uart->_rxfifo_full_thrhd, rxfifo_full_thrhd);
      uartEnd(uart_nr);
    } else {
      bool retCode = true;
      //User may just want to change some parameters, such as baudrate, data length, parity, stop bits or pins
      if (uart->_baudrate != baudrate) {
        retCode = uartSetBaudRate(uart, baudrate);
      }
      UART_MUTEX_LOCK();
      uart_word_length_t data_bits = (config & 0xc) >> 2;
      uart_parity_t parity = config & 0x3;
      uart_stop_bits_t stop_bits = (config & 0x30) >> 4;
      if (retCode && (uart->_config & 0xc) >> 2 != data_bits) {
        if (ESP_OK != uart_set_word_length(uart_nr, data_bits)) {
          log_e("UART%u changing data length failed.", uart_nr);
          retCode = false;
        } else {
          log_v("UART%u changed data length to %u", uart_nr, data_bits + 5);
        }
      }
      if (retCode && (uart->_config & 0x3) != parity) {
        if (ESP_OK != uart_set_parity(uart_nr, parity)) {
          log_e("UART%u changing parity failed.", uart_nr);
          retCode = false;
        } else {
          log_v("UART%u changed parity to %s", uart_nr, parity == 0 ? "NONE" : parity == 2 ? "EVEN" : "ODD");
        }
      }
      if (retCode && (uart->_config & 0xc30) >> 4 != stop_bits) {
        if (ESP_OK != uart_set_stop_bits(uart_nr, stop_bits)) {
          log_e("UART%u changing stop bits failed.", uart_nr);
          retCode = false;
        } else {
          log_v("UART%u changed stop bits to %u", uart_nr, stop_bits == 3 ? 2 : 1);
        }
      }
      if (retCode) {
        uart->_config = config;
      }
      UART_MUTEX_UNLOCK();
      if (retCode && (rxPin >= 0 || txPin >= 0)) {
        retCode &= uartSetPins(uart_nr, rxPin, txPin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
        if (!retCode) {
          log_e("UART%u changing pins failed.", uart_nr);
        }
      }
      if (retCode) {
        // UART driver was already working, just return the uart_t structure, saying that no new driver was installed
        return uart;
      }
      // if we reach this point, it means that we need to restart the UART driver
      uartEnd(uart_nr);
    }
  } else {
    log_v("UART%u not installed. Starting installation", uart_nr);
  }
  uart_config_t uart_config;
  memset(&uart_config, 0, sizeof(uart_config_t));
  uart_config.flags.backup_before_sleep = false;  // new flag from IDF v5.3
  uart_config.data_bits = (config & 0xc) >> 2;
  uart_config.parity = (config & 0x3);
  uart_config.stop_bits = (config & 0x30) >> 4;
  uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
  uart_config.rx_flow_ctrl_thresh = rxfifo_full_thrhd >= UART_HW_FIFO_LEN(uart_nr) ? UART_HW_FIFO_LEN(uart_nr) - 6 : rxfifo_full_thrhd;
  log_v(
    "UART%u RX FIFO full threshold set to %u (value requested: %u || FIFO Max = %u)", uart_nr, uart_config.rx_flow_ctrl_thresh, rxfifo_full_thrhd,
    UART_HW_FIFO_LEN(uart_nr)
  );
  rxfifo_full_thrhd = uart_config.rx_flow_ctrl_thresh;  // makes sure that it will be set correctly in the struct
  uart_config.baud_rate = baudrate;
#if SOC_UART_LP_NUM >= 1
  if (uart_nr >= SOC_UART_HP_NUM) {  // it is a LP UART NUM
    if (uart->_uart_clock_source >= 0) {
      uart_config.lp_source_clk = (soc_periph_lp_uart_clk_src_t)uart->_uart_clock_source;  // use user defined LP UART clock
      log_v("Setting UART%u to user defined LP clock source (%d) ", uart_nr, uart->_uart_clock_source);
    } else {
      uart_config.lp_source_clk = LP_UART_SCLK_DEFAULT;  // use default LP clock
      log_v("Setting UART%u to Default LP clock source", uart_nr);
    }
  } else
#endif  // SOC_UART_LP_NUM >= 1
  {
    if (uart->_uart_clock_source >= 0) {
      uart_config.source_clk = (soc_module_clk_t)uart->_uart_clock_source;  // use user defined HP UART clock
      log_v("Setting UART%u to user defined HP clock source (%d) ", uart_nr, uart->_uart_clock_source);
    } else {
      // there is an issue when returning from light sleep with the C6 and H2: the uart baud rate is not restored
      // therefore, uart clock source will set to XTAL for all SoC that support it. This fix solves the C6|H2 issue.
#if SOC_UART_SUPPORT_XTAL_CLK
      uart_config.source_clk = UART_SCLK_XTAL;  // valid for C2, S3, C3, C6, H2 and P4
      log_v("Setting UART%u to use XTAL clock", uart_nr);
#elif SOC_UART_SUPPORT_REF_TICK
      if (baudrate <= REF_TICK_BAUDRATE_LIMIT) {
        uart_config.source_clk = UART_SCLK_REF_TICK;  // valid for ESP32, S2 - MAX supported baud rate is 250 Kbps
        log_v("Setting UART%u to use REF_TICK clock", uart_nr);
      } else {
        uart_config.source_clk = UART_SCLK_APB;  // baudrate may change with the APB Frequency!
        log_v("Setting UART%u to use APB clock", uart_nr);
      }
#else
      // Default CLK Source: CLK_APB for ESP32|S2|S3|C3 -- CLK_PLL_F40M for C2 -- CLK_PLL_F48M for H2 -- CLK_PLL_F80M for C6|P4
      uart_config.source_clk = UART_SCLK_DEFAULT;  // baudrate may change with the APB Frequency!
      log_v("Setting UART%u to use DEFAULT clock", uart_nr);
#endif  // SOC_UART_SUPPORT_XTAL_CLK
    }
  }

  UART_MUTEX_LOCK();
  bool retCode = ESP_OK == uart_driver_install(uart_nr, rx_buffer_size, tx_buffer_size, 20, &(uart->uart_event_queue), 0);

  if (retCode) {
    retCode &= ESP_OK == uart_param_config(uart_nr, &uart_config);
  }

  if (retCode) {
    if (inverted) {
      // invert signal for both Rx and Tx
      uint32_t _inv_mask = uart->inv_mask;
      _inv_mask |= UART_SIGNAL_TXD_INV | UART_SIGNAL_RXD_INV;
      retCode &= ESP_OK == uart_set_line_inverse(uart_nr, _inv_mask);
      if (retCode) {
        uart->inv_mask = _inv_mask;
        log_v("UART%u: RX and TX signals are set to be inverted.", uart_nr);
      }
    } else {
      // disable invert signal for both Rx and Tx
      retCode &= ESP_OK == uart_set_line_inverse(uart_nr, UART_SIGNAL_INV_DISABLE);
      if (retCode) {
        uart->inv_mask = UART_SIGNAL_INV_DISABLE;
        log_v("UART%u: RX and TX signals are set not inverted.", uart_nr);
      }
    }
  }
  // if all fine, set internal parameters
  if (retCode) {
    uart->_baudrate = baudrate;
    uart->_config = config;
    uart->_inverted = inverted;
    uart->_rxfifo_full_thrhd = rxfifo_full_thrhd;
    uart->_rx_buffer_size = rx_buffer_size;
    uart->_tx_buffer_size = tx_buffer_size;
    uart->has_peek = false;
    uart->peek_byte = 0;
    // uart->_uart_clock_source can only change by explicit user API request/call
  }
  UART_MUTEX_UNLOCK();

  // uartSetPins detaches previous pins if new ones are used over a previous begin()
  // If any pins were pre-configured via setPins() before begin(), use those instead of UART_PIN_NO_CHANGE
  if (retCode) {
    log_v("UART%u calling uartSetPins: RX=%d, TX=%d, CTS=%d, RTS=%d", uart_nr, rxPin, txPin, uart->_ctsPin, uart->_rtsPin);
    retCode &= uartSetPins(uart_nr, rxPin, txPin, uart->_ctsPin, uart->_rtsPin);
  }
  if (!retCode) {
    log_e("UART%u initialization error.", uart->num);
    uartEnd(uart_nr);
    uart = NULL;
  } else {
    uartFlush(uart);
    log_v("UART%u initialization done.", uart->num);
  }
  return uart;  // a new driver was installed
}

